从DOS和Unix开始谈现代操作系统



从第一台计算机的诞生到如今普及的计算机发展的短短几十年，计算机的功能是越来越强大，与此同时，为了能

够更快，更高，更强，更人性，更加完美的实现计算机功能而不断发展。

目前，我们所使用的系统形形色色，但是，他们无非也是起源于两个系统——DOS和Unis。接下来我们就来介绍

一下这两个操作系统的发展。

首先，来谈一下DOS。目前，计算机所使用的操作系统最多的是微软的windows系统那么，windows操作系统则都

是从DOS操作系统上发展过来的。在最早的个人电脑上，所使用的系统就是DOS操作系统，微软收购DOS后，与

1970年后开发了MS-DOS系统。随着电脑硬件的不断发展，那种老式的电脑系统已经不能满足需求了，更加优化的

界面，以及更方便的操作方法是的图形化界面的windows系统则是更加实用。虽然系统更新了，但是MS-DOS的内

核依然存在与系统之中，直至windows95、98、ME。但是再强大的内核也会满足不了需求，之后被windows NT内核代

替了MS-DOS的内核。而windows NT内核处在于windows2000、XP、win7、win8，以及即将发布的win10系统中。目前来

说，windows系统在市场占有率还是很多的。

说完DOS系统后，接下来说一下Unix系统。Unix系统是一个强大的多用户，多任务操作系统，支持多种架构的操作系

统。Unix系统是从1965年的MULTICS操作系统计划中诞生的，后来的MULTICS操作系统被命名成Unix系统。对于

Unix系统来讲，也是比较古老的操作系统。它的贡献远远不只是曾经的操作系统而以。有它发展出来了好多类

Unix系统，即Unix-like.Unix-like系统的种类那就多了去了，其中包括传统的Unix系统（比如FreeBSD、

OpenBSD、SUN公司的Solaris）以及各种与传统Unix类似的系统（例如Minix、Linux、QNX等）。虽然这些软件

各有各的特殊，但是全部都在一定程度上遵守POSIX规范（POSIX定义了操作系统应该为应用程序提供的接口标准

）。举个例子Linux系统。它是众多类unix中的其中一种，而且是免费实用和自由传播的操作

系统，而且系统代码是开源的，可以供程序员自由更改，是IT行业的人比较喜欢的操作系统。运行主要的unix工

具软件，应用程序，网络协议。苹果系统的OSX系统也是类Unix系统的一种。虽说Unix系统以及类Unix在市场占

有率不高，但是其兼容性比较强大，也有良好的图形化界面，想必在未来的市场也会举足轻重。

科技还在进步，计算机还在发展。不管是windows系统也好，Linux系统也好，OSX也好，谁能够成为现代操作系统的主宰，不得而知。然而，不论是谁，想必也会是在现有的操作系统上更上一层楼。
